{"Teacher Shortages and Surpluses (General Teacher Preparation Policy)": "The state should inform district hiring needs with key teacher supply and demand data. The bar for this goal was raised in 2017.", "Program Performance Measures (General Teacher Preparation Policy)": "The state should collect and publicly report key data on the quality of teacher preparation programs. This goal was reorganized in 2017.", "Program Reporting Requirements (General Teacher Preparation Policy)": "The state's approval process for teacher preparation programs should hold programs accountable for the quality of the teachers they produce. This goal was reorganized in 2017.", "Student Teaching/Clinical Practice (General Teacher Preparation Policy)": "The state should ensure that teacher preparation programs provide teacher candidates with a high quality clinical experience. The bar for this goal was raised in 2017.", "Content Knowledge (Elementary Teacher Preparation Policy)": "The state should ensure that its teacher preparation programs provide elementary teachers with a broad liberal arts education, providing the necessary foundation for teaching to college- and career-readiness standards. This goal was consistent between 2015 and 2017.", "Teaching Mathematics (Elementary Teacher Preparation Policy)": "The state should ensure that new elementary teachers have sufficient knowledge of the mathematics content taught in elementary grades. This goal was consistent between 2015 and 2017.", "Teaching Reading (Elementary Teacher Preparation Policy)": "The state should ensure that new elementary teachers know the science of reading instruction and are prepared for the instructional shifts related to literacy associated with college-and career-readiness standards. This goal was consistent between 2015 and 2017.", "Licensure Deficiencies (Elementary Teacher Preparation Policy)": "The state should ensure that new teachers who can teach elementary grades on an early childhood license possess sufficient content knowledge in all core subjects and know the science of reading instruction.  This goal was consistent between 2015 and 2017.", "Middle School Content Knowledge (Secondary Teacher Preparation Policy)": "The state should ensure that middle school teachers are sufficiently prepared to teach appropriate grade-level content and for the ways that college- and career-readiness standards affect instruction of all subject areas. This goal was reorganized in 2017.", "Middle School Licensure Deficiencies (Secondary Teacher Preparation Policy)": "The state should distinguish between the preparation of middle school and elementary teachers. This goal was reorganized in 2017.", "Secondary Content Knowledge (Secondary Teacher Preparation Policy)": "The state should ensure that secondary teachers are sufficiently prepared to teach appropriate grade-level content. This goal was reorganized in 2017.", "Secondary Licensure Deficiencies (Secondary Teacher Preparation Policy)": "The state should ensure that secondary science and social studies teachers know all the subject matter they are licensed to teach. This goal was consistent between 2015 and 2017.", "Content Knowledge (Special Education Teacher Preparation Policy)": "The state should ensure that special education teachers know the subject matter they are licensed to teach. This goal was reorganized in 2017.", "Teaching Reading (Special Education Teacher Preparation Policy)": "The state should ensure that special education teachers know the science of reading instruction and are fully prepared for the instructional shifts related to literacy associated with college-and career-readiness standards. This goal was consistent between 2015 and 2017.", "Licensure Deficiencies (Special Education Teacher Preparation Policy)": "The state should distinguish between the preparation of elementary and secondary special education teachers.  This goal was reorganized in 2017.", "Program Entry (Alternate Routes Policy)": "The state should require alternate route programs to limit admission to candidates with strong academic backgrounds while also being flexible to the needs of nontraditional candidates. This goal was consistent between 2015 and 2017.", "Preparation for the Classroom (Alternate Routes Policy)": "The state should ensure that its alternate routes provide efficient preparation that is relevant to the immediate needs of new teachers, as well as intensive induction support.  The bar for this goal was raised in 2017.", "Requirements for Out-of-State Teachers (Hiring Policy)": "The state should help to make licenses fully portable among states for effective teachers, with appropriate safeguards. The bar for this goal was raised in 2017.", "Provisional and Emergency Licensure (Hiring Policy)": "The state should close loopholes that allow teachers who have not met licensure requirements to continue teaching. This goal was consistent between 2015 and 2017.", "Measures of Student Growth (Teacher and Principal Evaluation Policy)": "The state should require instructional effectiveness to be the determinative criterion of any teacher evaluation. The bar for this goal was raised in 2017.", "Measures of Professional Practice (Teacher and Principal Evaluation Policy)": "The state should ensure that teacher evaluations are well-structured to appropriately assess professional practice. This goal was new in 2017.", "Frequency of Evaluation and Observation (Teacher and Principal Evaluation Policy)": "The state should require annual evaluations of all teachers. The bar for this goal was raised in 2017.", "Linking Evaluation to Professional Growth (Teacher and Principal Evaluation Policy)": "The state should ensure that teachers receive feedback about their performance and should require professional development to be based on needs identified through teacher evaluations. This goal was reorganized in 2017.", "Data Systems Needed for Evaluation (Teacher and Principal Evaluation Policy)": "The state should have a data system that contributes some of the evidence needed to assess teacher effectiveness. The bar for this goal was raised in 2017.", "Distributing Teacher Talent Equitably (Teacher and Principal Evaluation Policy)": "The state should publicly report districts' distribution of teacher talent among schools to identify inequities in schools serving disadvantaged children. The bar for this goal was raised in 2017.", "Principal Effectiveness (Teacher and Principal Evaluation Policy)": "The state should meaningfully assess principal performance. This goal was new in 2017.", "Principal Evaluation and Observation (Teacher and Principal Evaluation Policy)": "The state should require annual evaluations with frequent observations of all principals. This goal was new in 2017.", "Performance (Teacher Compensation Policy)": "While giving local districts authority over pay scales, the state should ensure that effectiveness is a factor in teachers' compensation. The bar for this goal was raised in 2017.", "High-Need Schools and Subjects (Teacher Compensation Policy)": "The state should support differential pay for effective teaching in shortage and high-need areas. This goal was consistent between 2015 and 2017.", "Prior Work (Teacher Compensation Policy)": "The state should encourage districts to provide compensation for related prior subject-area work experience. This goal was consistent between 2015 and 2017.", "Licensure Advancement (Retaining Effective Teachers Policy)": "The state should base licensure advancement on evidence of teacher effectiveness. This goal was consistent between 2015 and 2017.", "Tenure (Retaining Effective Teachers Policy)": "The state should require that tenure decisions are based on evidence of teacher effectiveness. This goal was reorganized in 2017.", "Leadership Opportunities (Retaining Effective Teachers Policy)": "The state should support teachers to take on leadership opportunities that allow them to continue teaching. This goal was new in 2017.", "Dismissal (Retaining Effective Teachers Policy)": "The state should articulate that ineffective classroom performance is grounds for dismissal and ensure that the process for terminating ineffective teachers is expedient and fair to all parties. This goal was consistent between 2015 and 2017.", "Layoffs (Retaining Effective Teachers Policy)": "The state should require that its school districts consider classroom performance as a factor in determining which teachers are laid off when a reduction in force is necessary. The bar for this goal was raised in 2017.", "Content Knowledge (Early Childhood Preparation Policy)": "The state should require its teacher preparation programs to provide early childhood teachers with age-appropriate content knowledge and instructional strategies. Starting in 2020, this goal is now graded. ", "Academic Requirements (Early Childhood Preparation Policy)": "The state should require early childhood teacher candidates to meet appropriate academic requirements. Starting in 2020, this goal is now graded. ", "Program Entry (General Teacher Preparation Policy)": "The state should require teacher preparation programs to admit only candidates with strong academic records and support programs to encourage greater numbers of qualified individuals of color to become teachers. The bar for this goal was raised in 2017.", "Adolescent Literacy (Secondary Teacher Preparation Policy)": "The state should ensure that new middle school and secondary teachers are fully prepared for the instructional shifts related to literacy associated with college-and career-readiness standards. This goal was reorganized in 2017.", "Admission into Teacher Preparation (Delivering Well Prepared Teachers Policy)": "The state should require teacher preparation programs to admit only candidates with strong academic records. ", "Elementary Teacher Preparation (Delivering Well Prepared Teachers Policy)": "The state should ensure that its teacher preparation programs provide elementary teachers with a broad liberal arts education, the necessary foundation for teaching to the Common Core Standards.", "Elementary Teacher Preparation in Reading Instruction ( (Delivering Well Prepared Teachers Policy)": "The state should ensure that new elementary teachers know the science of reading instruction. ", "Elementary Teacher Preparation in Mathematics (Delivering Well Prepared Teachers Policy)": "The state should ensure that new elementary teachers have sufficient knowledge of the mathematics content taught in elementary grades.  ", "Early Childhood (Delivering Well Prepared Teachers Policy)": "The state should ensure that new teachers who can teach elementary grades on an early childhood license possess sufficient content knowledge in all core subjects and know the science of reading instruction.  ", "Middle School Teacher Preparation (Delivering Well Prepared Teachers Policy)": "The state should ensure that middle school teachers are sufficiently prepared to teach appropriate grade-level content.", "Secondary Teacher Preparation (Delivering Well Prepared Teachers Policy)": "The state should ensure that secondary teachers are sufficiently prepared to teach appropriate grade-level content.", "Secondary Teacher Preparation in Science and Social Studies ( (Delivering Well Prepared Teachers Policy)": "The state should ensure that secondary science and social studies teachers know all the subject matter they are licensed to teach.", "Special Education Teacher Preparation (Delivering Well Prepared Teachers Policy)": "The state should ensure that special education teachers know the subject matter they will be required to teach.", "Special Education Preparation in Reading (Delivering Well Prepared Teachers Policy)": "The state should ensure that special education teachers know the science of reading instruction and are sufficiently prepared  for the  instructional shifts related to literacy associated with college-and career-readiness standards. ", "Assessing Professional Knowledge (Delivering Well Prepared Teachers Policy)": "The state should use a licensing test to verify that all new teachers meet its professional standards. ", "Student Teaching (Delivering Well Prepared Teachers Policy)": "The state should ensure that teacher preparation programs provide teacher candidates with a high-quality clinical experience. ", "Teacher Preparation Program Accountability (Delivering Well Prepared Teachers Policy)": "The state's approval process for teacher preparation programs should hold programs accountable for the quality of the teachers they produce. ", "Alternate Route Eligibility (Expanding the Pool of Teachers Policy)": "The state should require alternate route programs to exceed the admission requirements of traditional preparation programs while also being flexible to the needs of nontraditional candidates.", "Alternate Route Preparation (Expanding the Pool of Teachers Policy)": "The state should ensure that its alternate routes provide streamlined preparation that is relevant to the immediate needs of new teachers.", "Alternate Route Usage and Providers (Expanding the Pool of Teachers Policy)": "The state should provide an alternate route that is free from regulatory obstacles that limit its usage and providers.", "Part-Time Teaching Licenses (Expanding the Pool of Teachers Policy)": "The state should offer a license with minimal requirements that allows content experts to teach part time.", "Licensure Reciprocity (Expanding the Pool of Teachers Policy)": "The state should help to make licenses fully portable among states, with appropriate safeguards.", "State Data Systems (Identifying Effective Teachers Policy)": "The state should have a data system that contributes some of the evidence needed to assess teacher effectiveness.   ", "Evaluation of Effectiveness (Identifying Effective Teachers Policy)": "The state should require instructional effectiveness to be the preponderant criterion of any teacher evaluation.   ", "Frequency of Evaluations (Identifying Effective Teachers Policy)": "The state should require annual evaluations of all teachers.", "Tenure (Identifying Effective Teachers Policy)": "The state should require that tenure decisions are based on evidence of teacher effectiveness.   ", "Licensure Advancement (Identifying Effective Teachers Policy)": "The state should base licensure advancement on evidence of teacher effectiveness. ", "Equitable Distribution (Identifying Effective Teachers Policy)": "The state should publicly report districts' distribution of teacher talent among schools to identify inequities in schools serving disadvantaged children.  ", "New Teacher Induction (Retaining Effective Teachers Policy)": "The state should require effective induction for all new teachers, with special emphasis on teachers in high-need schools.", "Professional Development (Retaining Effective Teachers Policy)": "The state should require professional development to be based on needs identified through teacher evaluations.", "Pay Scales and Performance Pay (Retaining Effective Teachers Policy)": "While giving local districts authority over pay scales, the state should ensure that effectiveness is a factor in teachers' compensation.  ", "Differential Pay (Retaining Effective Teachers Policy)": "The state should support differential pay for effective teaching in shortage and high-needs areas.", "Compensation for Prior Work Experience (Retaining Effective Teachers Policy)": "The state should encourage districts to provide compensation for related prior subject-area work experience.", "Extended Emergency Licenses (Exiting Ineffective Teachers Policy)": "The state should close loopholes that allow teachers who have not met licensure requirements to continue teaching.", "Dismissal for Poor Performance (Exiting Ineffective Teachers Policy)": "The state should articulate that ineffective classroom performance is grounds for dismissal and ensure that the process for terminating ineffective teachers is expedient and fair to all parties.", "Reductions in Force (Exiting Ineffective Teachers Policy)": "The state should require that its school districts consider classroom performance as a factor in determining which teachers are laid off when a reduction in force is necessary.", "Pension Flexibility (Pensions Policy)": "The state should ensure that pension systems are portable, flexible and fair to all teachers.", "Pension Sustainability (Pensions Policy)": "The state should ensure that excessive resources are not committed to funding teachers' pension systems.", "Pension Neutrality (Pensions Policy)": "The state should ensure that pension systems are neutral, uniformly increasing pension wealth with each additional year of work.", "Pension Transparency (Pensions Policy)": "The state should disclose all financial and other data necessary for policymakers, school districts and the general public to have a clear and accurate depiction of the current standing and future health of the system. State teacher retirement systems als", "Secondary Teacher Preparation in Science (Delivering Well Prepared Teachers Policy)": "The state should ensure that science teachers know all the subject matter they are licensed to teach.", "Induction (Retaining Effective Teachers Policy)": "The state should require effective induction for all new teachers, with special emphasis on teachers in high-needs schools.", "Pay Scales (Retaining Effective Teachers Policy)": "The state should give local districts authority over pay scales.", "Performance Pay (Retaining Effective Teachers Policy)": "The state should support performance pay but in a manner that recognizes its appropriate uses and limitations.", "Admission into Preparation Programs (Delivering Well Prepared Teachers Policy)": "The state should require undergraduate teacher preparation programs to admit only candidates with good academic records. ", "Secondary Teacher Preparation in Social Studies ( (Delivering Well Prepared Teachers Policy)": "The state should ensure that social studies teachers know all the subject matter they are licensed to teach.", "Part Time Teaching Licenses (Expanding the Pool of Teachers Policy)": "The state should offer a license with minimal requirements that allows content experts to teach part time.", "Pension Flexibility (Retaining Effective Teachers Policy)": "The state should ensure that pension systems are portable, flexible and fair to all teachers.", "Pension Sustainability (Retaining Effective Teachers Policy)": "The state should ensure that excessive resources are not committed to funding teachers' pension systems.", "Pension Neutrality (Retaining Effective Teachers Policy)": "The state should ensure that pension systems are neutral, uniformly increasing pension wealth with each additional year of work.", "Licensure Loopholes (Exiting Ineffective Teachers Policy)": "The state should close loopholes that allow teachers who have not met licensure requirements to continue teaching.", "Unsatisfactory Evaluations (Exiting Ineffective Teachers Policy)": "The state should articulate consequences for teachers with unsatisfactory evaluations, including specifying that teachers with multiple unsatisfactory evaluations should be eligible for dismissal."}